tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_REPEAT_2);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 2u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) != 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 1u,
           "REPEAT initializes a program-hole target");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 1u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) != 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 2u,
           "REPEAT retains provenance for a program-hole rewind");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->rcount == 0u && cpu->repeat_active != 0u &&
               (cpu->sr & 0x0010u) == 0u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 3u,
           "REPEAT clears RA when the counter reaches zero");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x55802u &&
               cpu->rcount == 0u && cpu->repeat_active == 0u &&
               (cpu->sr & 0x0010u) == 0u &&
               cpu->sequential_program_hole_pc == 0x55802u && cpu->cycles == 4u,
           "REPEAT executes the final program-hole iteration once");

    reset_processor_conformance(cpu, DSPIC33_PROGRAM_LIMIT);
    expect(state,
           dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 0u,
           "direct host entry into program hole remains a bounds stop");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "sequential provenance prepares exact next hole address");
    cpu->pc = 0x55802u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS &&
               cpu->sequential_program_hole_pc == 0u,
           "host PC rewrite cannot reuse stale sequential provenance");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, 0x000100u);
    load_instruction(state, cpu, 0x000100u, OPCODE_NOP);
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "sequential program hole prepares interrupt return");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000102u &&
               cpu->interrupt_log_entry[0] == DSPIC33_PROGRAM_LIMIT &&
               cpu->w[15] == 0x5004u && dspic33_read_word(cpu, 0x5000u) == 0x5800u &&
               dspic33_read_word(cpu, 0x5002u) == 0x0005u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 2u,
           "interrupt redirects and stacks program hole PC without provenance leak");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, DSPIC33_PROGRAM_LIMIT);
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "same-PC interrupt prepares sequential provenance");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS && cpu->interrupt_count == 1u &&
               cpu->pc == DSPIC33_PROGRAM_LIMIT && cpu->w[15] == 0x5004u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 1u,
           "confirmed same-PC interrupt dispatch clears sequential provenance");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    load_instruction(state, cpu, 0x00000cu, DSPIC33_PROGRAM_LIMIT);
    cpu->stop_on_trap = false;
    cpu->w[15] = 0x5000u;
    cpu->pending_soft_traps[0].trap = 4u;
    cpu->pending_soft_traps[0].vector = 0x00000cu;
    cpu->pending_soft_traps[0].priority = 11u;
    cpu->pending_soft_traps[0].delay = 1u;
    cpu->pending_soft_traps[0].active = true;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->last_trap == 4u &&
               cpu->pc == DSPIC33_PROGRAM_LIMIT && cpu->w[15] == 0x5004u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 1u,
           "delayed same-PC soft trap clears sequential provenance");
    expect(state, dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS,
           "soft-trap target cannot inherit sequential hole authorization");

    reset_processor_conformance(cpu, 0u);
    cpu->pc = DSPIC33_AUXILIARY_PROGRAM_BASE - 2u;
    cpu->sequential_program_hole_pc = cpu->pc;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->pc == DSPIC33_AUXILIARY_PROGRAM_BASE &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 1u,
           "sequential hole provenance ends at auxiliary program boundary");
    expect(state, dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS,
           "auxiliary program boundary retains existing bounds behavior");
}

static void skip_boundary_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    cpu->w[2] = 1u;
    cpu->sr = 0x0103u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u && cpu->cycles == 1u &&
               cpu->sr == 0x0103u,
           "untaken BTSC consumes one cycle and preserves status");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    cpu->w[2] = 0u;
    cpu->sr = 0x0103u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 4u && cpu->cycles == 2u &&
               cpu->sr == 0x0103u,
           "taken BTSC over one-word instruction consumes two cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BTSS_W2_BIT_0);
    load_instruction(state, cpu, 2u, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 4u, 0u);
    cpu->w[2] = 1u;
    cpu->w[15] = 0x5000u;
    cpu->sr = 0x0103u;
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 6u && cpu->cycles == 3u &&
               cpu->w[15] == 0x5000u && cpu->call_depth == 0u &&
               dspic33_read_word(cpu, 0x5000u) == 0xa5a5u && cpu->sr == 0x0103u,
           "taken BTSS discards complete two-word CALL in three cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BTSC_W4_POST_INCREMENT_BIT_0);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    dspic33_set_working_register(cpu, 4u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 4u && cpu->cycles == 2u &&
               cpu->w[4] == 0x1002u,
           "taken indirect BTSC completes source pointer update");

    reset_processor_conformance(cpu, 0x557fcu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557fcu;
    load_instruction(state, cpu, 0x557fcu, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    cpu->w[2] = 0u;
    cpu->sr = 0x0103u;
    cpu->corcon = 0x0020u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->pc == 0x140u &&
               cpu->cycles == 2u && cpu->last_trap == 1u &&
               cpu->last_trap_return == DSPIC33_PROGRAM_LIMIT && cpu->w[15] == 0x5004u,
           "one-word boundary skip raises Address Error in two cycles");
    expect(state,
           dspic33_read_word(cpu, 0x5000u) == 0x5800u &&
               dspic33_read_word(cpu, 0x5002u) == 0x0305u &&
               (dspic33_read_word(cpu, 0x08c0u) & 0x0008u) != 0u &&
               dspic33_read_word(cpu, 0x08c8u) == 0x0e01u &&
               cpu->sequential_program_hole_pc == 0u,
           "boundary skip stacks exact hole PC and hard-trap state");

    reset_processor_conformance(cpu, 0x557fcu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557fcu;
    load_instruction(state, cpu, 0x557fcu, OPCODE_BTSC_W4_POST_INCREMENT_BIT_0);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    dspic33_set_working_register(cpu, 4u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->w[4] == 0x1002u &&
               cpu->cycles == 2u,
           "boundary skip trap preserves completed indirect source update");

    reset_processor_conformance(cpu, 0x557fau);
    load_instruction(state, cpu, 0x557fau, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 0x557fcu, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 0x557feu, 0u);
    cpu->w[2] = 0u;
    cpu->w[15] = 0x5000u;
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 3u && cpu->w[15] == 0x5000u && cpu->call_depth == 0u &&
               dspic33_read_word(cpu, 0x5000u) == 0xa5a5u,
           "two-word boundary skip enters the program hole in three cycles");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x55802u &&
               cpu->sequential_program_hole_pc == 0x55802u && cpu->cycles == 4u,
           "two-word skip provenance authorizes the next hole instruction");

    reset_processor_conformance(cpu, 0x557fau);
    load_instruction(state, cpu, 0x557fau, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 0x557fcu, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 0x557feu, 0u);
    load_instruction(state, cpu, 0x000014u, 0x000100u);
    load_instruction(state, cpu, 0x000100u, OPCODE_NOP);
    cpu->w[2] = 0u;
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "two-word skip prepares interrupt lifecycle case");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x102u &&
               cpu->interrupt_log_entry[0] == DSPIC33_PROGRAM_LIMIT &&
               cpu->w[15] == 0x5004u && dspic33_read_word(cpu, 0x5000u) == 0x5800u &&
               dspic33_read_word(cpu, 0x5002u) == 0x0005u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 4u,
           "interrupt clears two-word skip provenance and stacks hole PC");

    reset_processor_conformance(cpu, 0x557fcu);
    load_instruction(state, cpu, 0x557fcu, OPCODE_BTSC_W2_BIT_0);
    load_instruction(state, cpu, 0x557feu, OPCODE_CALL_0X100);
    cpu->w[2] = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x55802u &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 3u,
           "skipped extension collision remains outside sequential provenance");
    expect(state, dspic33_step(cpu) == DSPIC33_PROGRAM_BOUNDS,
           "excluded skipped extension collision retains bounds behavior");
}

static void compare_skip_truth_case(ProcessorConformance* state, Dspic33* cpu,
                                    uint32_t opcode, uint16_t left, uint16_t right,
                                    bool taken, const char* name) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, opcode | 1u);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    cpu->w[0] = left;
    cpu->w[1] = right;
    cpu->sr = 0x010fu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == (taken ? 4u : 2u) &&
               cpu->cycles == (taken ? 2u : 1u) && cpu->w[0] == left &&
               cpu->w[1] == right && cpu->sr == 0x010fu,
           name);
}

static void compare_skip_cases(ProcessorConformance* state, Dspic33* cpu) {
    compare_skip_truth_case(state, cpu, OPCODE_CPSEQ, 0x1234u, 0x1234u, true,
                            "CPSEQ word takes equal comparison");
    compare_skip_truth_case(state, cpu, OPCODE_CPSEQ, 0x1234u, 0x4321u, false,
                            "CPSEQ word rejects unequal comparison");
    compare_skip_truth_case(state, cpu, OPCODE_CPSEQ | OPCODE_COMPARE_SKIP_BYTE,
                            0x80ffu, 0x7fffu, true,
                            "CPSEQ byte ignores high-byte difference");
    compare_skip_truth_case(state, cpu, OPCODE_CPSEQ | OPCODE_COMPARE_SKIP_BYTE,
                            0x8000u, 0x0001u, false,
                            "CPSEQ byte rejects unequal low bytes");
    compare_skip_truth_case(state, cpu, OPCODE_CPSNE, 0x1234u, 0x4321u, true,
                            "CPSNE word takes unequal comparison");
    compare_skip_truth_case(state, cpu, OPCODE_CPSNE, 0x1234u, 0x1234u, false,
                            "CPSNE word rejects equal comparison");
    compare_skip_truth_case(state, cpu, OPCODE_CPSNE | OPCODE_COMPARE_SKIP_BYTE,
                            0x80ffu, 0x7fffu, false,
                            "CPSNE byte ignores high-byte difference");
    compare_skip_truth_case(state, cpu, OPCODE_CPSNE | OPCODE_COMPARE_SKIP_BYTE,
                            0x8000u, 0x0001u, true,
                            "CPSNE byte takes unequal low bytes");
    compare_skip_truth_case(state, cpu, OPCODE_CPSGT, 0x0001u, 0xffffu, true,
                            "CPSGT word uses signed greater-than");
    compare_skip_truth_case(state, cpu, OPCODE_CPSGT, 0xffffu, 0x0001u, false,
                            "CPSGT word rejects signed reverse order");
    compare_skip_truth_case(state, cpu, OPCODE_CPSGT | OPCODE_COMPARE_SKIP_BYTE,
                            0x007fu, 0x0080u, true,
                            "CPSGT byte uses signed greater-than");
    compare_skip_truth_case(state, cpu, OPCODE_CPSGT | OPCODE_COMPARE_SKIP_BYTE,
                            0x0080u, 0x007fu, false,
                            "CPSGT byte rejects signed reverse order");
    compare_skip_truth_case(state, cpu, OPCODE_CPSLT, 0xffffu, 0x0001u, true,
                            "CPSLT word uses signed less-than");
    compare_skip_truth_case(state, cpu, OPCODE_CPSLT, 0x0001u, 0xffffu, false,
                            "CPSLT word rejects signed reverse order");
    compare_skip_truth_case(state, cpu, OPCODE_CPSLT | OPCODE_COMPARE_SKIP_BYTE,
                            0x0080u, 0x007fu, true, "CPSLT byte uses signed less-than");
    compare_skip_truth_case(state, cpu, OPCODE_CPSLT | OPCODE_COMPARE_SKIP_BYTE,
                            0x007fu, 0x0080u, false,
                            "CPSLT byte rejects signed reverse order");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CPSEQ | 1u);
    load_instruction(state, cpu, 2u, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 4u, 0u);
    cpu->w[0] = 0x55aau;
    cpu->w[1] = 0x55aau;
    cpu->w[15] = 0x5000u;
    cpu->sr = 0x010fu;
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 6u && cpu->cycles == 3u &&
               cpu->w[15] == 0x5000u && cpu->call_depth == 0u &&
               dspic33_read_word(cpu, 0x5000u) == 0xa5a5u && cpu->sr == 0x010fu,
           "CPSEQ skips complete two-word instruction in three cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CPSEQ | (15u << 11u) | 14u);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    cpu->w[15] = 0x5000u;
    cpu->w[14] = 0x5000u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 4u &&
               cpu->w[15] == 0x5000u && cpu->call_depth == 0u &&
               cpu->illegal_reset_count == 0u,
           "CPSEQ treats W15 as comparison data without pointer side effects");

    reset_processor_conformance(cpu, 0x557fcu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557fcu;
    load_instruction(state, cpu, 0x557fcu, OPCODE_CPSEQ | 2u);
    load_instruction(state, cpu, 0x557feu, OPCODE_NOP);
    cpu->w[0] = 0x1234u;
    cpu->w[2] = 0x1234u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0020u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->pc == 0x140u &&
               cpu->cycles == 2u && cpu->last_trap == 1u &&
               cpu->last_trap_return == 0x557feu && cpu->w[15] == 0x5004u,
           "CPSEQ boundary skip traps with caller-specific return PC");
    expect(state,
           dspic33_read_word(cpu, 0x5000u) == 0x57feu &&
               dspic33_read_word(cpu, 0x5002u) == 0x0f05u &&
               dspic33_read_word(cpu, 0x08c8u) == 0x0e01u && cpu->sr == 0x01cfu &&
               cpu->corcon == 0x0028u,
           "CPSEQ boundary trap preserves exact frame and priority state");

    reset_processor_conformance(cpu, 0x557fau);
    load_instruction(state, cpu, 0x557fau, OPCODE_CPSEQ | 2u);
    load_instruction(state, cpu, 0x557fcu, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 0x557feu, 0u);
    cpu->w[0] = 0x55aau;
    cpu->w[2] = 0x55aau;
    cpu->w[15] = 0x5000u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 3u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->w[15] == 0x5000u && cpu->call_depth == 0u,
           "CPSEQ two-word boundary skip establishes sequential provenance");
    load_instruction(state, cpu, 0x000014u, 0x000100u);
    load_instruction(state, cpu, 0x000100u, OPCODE_NOP);
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x102u &&
               cpu->interrupt_log_entry[0] == DSPIC33_PROGRAM_LIMIT &&
               cpu->sequential_program_hole_pc == 0u && cpu->cycles == 4u,
           "interrupt clears CPSEQ two-word skip provenance");

    reset_processor_conformance(cpu, 0x557feu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557feu;
    load_instruction(state, cpu, 0x557feu, OPCODE_CPSEQ | 1u);
    cpu->w[0] = 0x1234u;
    cpu->w[1] = 0x1234u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0020u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->cycles == 2u &&
               cpu->last_trap_return == DSPIC33_PROGRAM_LIMIT &&
               dspic33_read_word(cpu, 0x5000u) == 0x5800u &&
               dspic33_read_word(cpu, 0x5002u) == 0x0f05u,
           "taken last-word CPSEQ traps as a two-cycle one-word skip");

    reset_processor_conformance(cpu, 0x557feu);
    load_instruction(state, cpu, 0x557feu, OPCODE_CPSEQ | 1u);
    cpu->w[0] = 0u;
    cpu->w[1] = 1u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == DSPIC33_PROGRAM_LIMIT &&
               cpu->cycles == 1u &&
               cpu->sequential_program_hole_pc == DSPIC33_PROGRAM_LIMIT,
           "untaken last-word CPSEQ enters the hole sequentially in one cycle");

    reset_processor_conformance(cpu, 0x557feu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557feu;
    load_instruction(state, cpu, 0x557feu, OPCODE_BTSS_W2_BIT_0);
    cpu->w[2] = 1u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0020u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->cycles == 2u &&
               cpu->last_trap_return == DSPIC33_PROGRAM_LIMIT &&
               dspic33_read_word(cpu, 0x5000u) == 0x5800u,
           "taken last-word BTSS shares the two-cycle Address Error fix");

    reset_processor_conformance(cpu, 0x557feu);
    prepare_address_trap(state, cpu);
    cpu->pc = 0x557feu;
    load_instruction(state, cpu, 0x557feu, OPCODE_BTSC_W4_POST_INCREMENT_BIT_0);
    dspic33_set_working_register(cpu, 4u, 0x1001u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->cycles == 1u &&
               cpu->last_trap_return == DSPIC33_PROGRAM_LIMIT && cpu->w[4] == 0x1001u &&
               dspic33_read_word(cpu, 0x5000u) == 0x5800u,
           "last-word indirect BTSC operand fault remains a one-cycle Address Error");
}

static void prepare_timer_source(Dspic33* cpu) {
    dspic33_write_word(cpu, 0x0110u, 0x0008u);
    dspic33_write_word(cpu, 0x0108u, 0x5555u);
    dspic33_write_word(cpu, 0x0106u, 0x1234u);
    dspic33_write_word(cpu, 0x0108u, 0xaaaau);
}

static void completed_source_address_error_case(ProcessorConformance* state,
                                                Dspic33* cpu, uint32_t opcode,
                                                uint16_t stacked_flags,
                                                const char* execution,
                                                const char* completion) {
    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, opcode);
    prepare_timer_source(cpu);
    dspic33_write_word(cpu, 0x1000u, 0x1122u);
    dspic33_write_word(cpu, 0x1002u, 0x3344u);
    cpu->w[2] = 2u;
    cpu->w[4] = 0x0106u;
    cpu->w[5] = 0x1001u;
    expect_address_trap(state, cpu, execution);
    expect(state,
           dspic33_read_word(cpu, 0x0108u) == 0x5555u && cpu->w[4] == 0x0108u &&
               cpu->w[5] == 0x1001u && dspic33_read_word(cpu, 0x1000u) == 0x1122u &&
               dspic33_read_word(cpu, 0x1002u) == 0x3344u &&
               (dspic33_read_word(cpu, 0x5002u) & 0xff00u) == stacked_flags,
           completion);
}

